[
  {
    "WorkshopTrackId": "2a8a02f7-186f-4297-97b7-2174c5880531",
    "Title": "Registrazione",
    "Image": null,
    "StartTime": "2020-01-24T14:30:00",
    "EndTime": "2020-01-24T15:00:00",
    "Abstract": "Registrazione",
    "Level": 0,
    "Speakers": [],
    "WorkshopId": "1f322045-c9d2-4e9e-9c82-17ab57721eb2"
  },
  {
    "WorkshopTrackId": "ae1747d5-9971-4779-a07c-665fa49803d1",
    "Title": "Diamo un lato umano alle nostre app con l\u0027AI",
    "Image": null,
    "StartTime": "2020-01-24T17:00:00",
    "EndTime": "2020-01-24T18:00:00",
    "Abstract": null,
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "1f322045-c9d2-4e9e-9c82-17ab57721eb2"
  },
  {
    "WorkshopTrackId": "1c5e013a-7de1-47be-90c0-81b974850641",
    "Title": "Introduzione a ML.NET",
    "Image": null,
    "StartTime": "2020-01-24T15:00:00",
    "EndTime": "2020-01-24T16:00:00",
    "Abstract": null,
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "1f322045-c9d2-4e9e-9c82-17ab57721eb2"
  },
  {
    "WorkshopTrackId": "7fbc0878-d5ee-4722-ac8d-c6433a88c5a5",
    "Title": "Introduzione ai Cognitive Services",
    "Image": null,
    "StartTime": "2020-01-24T16:00:00",
    "EndTime": "2020-01-24T17:00:00",
    "Abstract": null,
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "1f322045-c9d2-4e9e-9c82-17ab57721eb2"
  },
  {
    "WorkshopTrackId": "cfd866e1-d450-4095-a3b3-992da86c33b0",
    "Title": "Le novità importanti",
    "Image": null,
    "StartTime": "2022-07-04T17:15:00",
    "EndTime": "2022-07-04T18:00:00",
    "Abstract": "Approfondimento sui temi che ci hanno colpito di più e a cosa potrebbero portare",
    "Level": 0,
    "Speakers": [],
    "WorkshopId": "97b2851a-8a1e-4d7a-8a19-1a822b914b51"
  },
  {
    "WorkshopTrackId": "2b82a306-ec4e-4cc3-8255-716574a61a09",
    "Title": "Introduzione",
    "Image": null,
    "StartTime": "2022-07-04T16:30:00",
    "EndTime": "2022-07-04T17:15:00",
    "Abstract": "Introduzione agli annunci tecnologici che hanno più risonanza nel mondo dello sviluppo",
    "Level": 0,
    "Speakers": [],
    "WorkshopId": "97b2851a-8a1e-4d7a-8a19-1a822b914b51"
  },
  {
    "WorkshopTrackId": "0a336129-c062-4a42-8b51-25a7df871d0c",
    "Title": "Question?",
    "Image": null,
    "StartTime": "2022-07-04T18:00:00",
    "EndTime": "2022-07-04T18:30:00",
    "Abstract": "Panel finale - sessione domande e risposte",
    "Level": 0,
    "Speakers": [],
    "WorkshopId": "97b2851a-8a1e-4d7a-8a19-1a822b914b51"
  },
  {
    "WorkshopTrackId": "59b5d931-de0a-40de-9439-69771a6cbe4e",
    "Title": "Web API all\u0027opera: realizziamo il backend dell\u0027applicazione",
    "Image": null,
    "StartTime": "2019-04-18T17:30:00",
    "EndTime": "2019-04-18T18:30:00",
    "Abstract": "In questa sessione entreremo nel vivo dello sviluppo di un backend con ASP.NET Core mostrando come realizzare efficacemente delle API per un\u0027app mobile: dall\u0027autenticazione fino all\u0027accesso ai dati, passando per la gestione degli errori e il versionamento.\r\nIn pratica esporremo come adottare il meglio delle varie soluzioni offerte da ASP.NET Core, illustrandone i pro e i contro.",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "9f7725e4-479b-4dff-ace5-1ee3b599c08c"
  },
  {
    "WorkshopTrackId": "00caf73b-4523-49c3-9260-b079c3e3dc3a",
    "Title": "Intro",
    "Image": null,
    "StartTime": "2019-04-18T16:00:00",
    "EndTime": "2019-04-18T16:30:00",
    "Abstract": "Introduzione all\u0027evento",
    "Level": 0,
    "Speakers": [],
    "WorkshopId": "9f7725e4-479b-4dff-ace5-1ee3b599c08c"
  },
  {
    "WorkshopTrackId": "96c64b86-d927-49af-b671-eaeb3fd91878",
    "Title": "Nativescript: da Web a Mobile nativo in zero secondi.",
    "Image": null,
    "StartTime": "2019-04-18T18:30:00",
    "EndTime": "2019-04-18T19:30:00",
    "Abstract": "Riutilizzare le proprie skill di sviluppo web per realizzare applicazioni native per IOS e Android tramite l’utilizzo di Nativescript.\r\nVedremo come realizzare una semplice applicazione cross platform per interrogare un servizio WebApi basato su ASP.NET Core.",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "9f7725e4-479b-4dff-ace5-1ee3b599c08c"
  },
  {
    "WorkshopTrackId": "1cb4f2ad-ec35-488e-bba6-eee2f6eaad1d",
    "Title": "La rivoluzione di ASP.NET Core nel mondo delle Web API",
    "Image": null,
    "StartTime": "2019-04-18T16:30:00",
    "EndTime": "2019-04-18T17:30:00",
    "Abstract": "ASP.NET Core è una totale riscrittura del precedente ASP.NET che ha permesso una drastica semplificazione e performance mai viste prima.\r\nDopo una breve introduzione al mondo di .NET Core e netstandard saranno analizzate le nuove architetture e servizi offerti, come la dependency injection integrata, il logging e la gestione delle configurazioni.\r\nInoltre saranno esposte le diverse possibili alternative per creare un backend basato sullo stile architetturale REST, nonché l\u0027uso delle websocket.",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "9f7725e4-479b-4dff-ace5-1ee3b599c08c"
  },
  {
    "WorkshopTrackId": "221862ab-5e42-4c76-a6c1-e18b9b8bf511",
    "Title": "Dependency Injection e IoC in .Net",
    "Image": null,
    "StartTime": "2011-09-30T19:00:00",
    "EndTime": "2011-09-30T20:00:00",
    "Abstract": "Per IoC si intende un pattern di programmazione secondo il quale si tende a tener disaccoppiati i singoli componenti di un sistema, in cui le eventuali dipendenze non vengonoscritte all\u0027interno del componente stesso, ma gli vengono iniettate dall\u0027esterno. La Dependency Injection è una delle tecniche con le quali si può attuare l\u0027IOC; Essa prende il controllo su tutti gli aspetti di creazione degli oggetti e delle loro dipendenze. Alessandro ci farà vedere con esempi di codice quali siano i vantaggi, vedremo inoltre come utilizzare in particolare Unity Application Block che è un DI Container.",
    "Level": 300,
    "Speakers": [],
    "WorkshopId": "0d2b7baa-7032-41d4-823c-232df495f841"
  },
  {
    "WorkshopTrackId": "774ead5d-0fc9-4634-8c5f-929f3ab62fd9",
    "Title": "WinRT e il futuro dello sviluppo",
    "Image": null,
    "StartTime": "2011-09-30T18:00:00",
    "EndTime": "2011-09-30T19:00:00",
    "Abstract": "La nuova generazione di applicazioni Metro per Windows 8 sarà interamente basata sul nuovo runtime chiamato WinRT, costruita con codice nativo derivato da COM. WinRT costituisce una reale rivoluzione in Windows, esponendo le funzionalità del sistema operativo, una volta prerogativa esclusiva di Win32, in modo object oriented e permettendo una reale equità di trattamento a linguaggi come C\u002B\u002B, C#, VB.NET e Javascript. La libreria di WinRT integra anche un nuovo motore di rendering XAML che permette a questi linguaggi di usufruire di questo linguaggio di markup.Durante la sessione analizzeremo con cura l\u0027architettura di questo nuovo runtime e quale sia il futuro delle applicazioni e dello sviluppo sotto Windows.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "0d2b7baa-7032-41d4-823c-232df495f841"
  },
  {
    "WorkshopTrackId": "98443726-0b79-4256-b038-57b55e2c2580",
    "Title": "Roundtable \u0022//build/\u0022",
    "Image": null,
    "StartTime": "2011-09-30T17:00:00",
    "EndTime": "2011-09-30T18:00:00",
    "Abstract": "Discussione aperta tra tutti i partecipanti e Raffaele Rialdi che ha partecipato alla //build/ conference. Tavola rotonda sulle novità presentate alla “Build” di Los Anageles: Windows 8, WinRT , le novità legate allo sviluppo Visual Studio 2011, le applicazioni metro style, HTML5, ecc.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "0d2b7baa-7032-41d4-823c-232df495f841"
  },
  {
    "WorkshopTrackId": "0c540cf6-a692-4495-8b22-56b7a7482315",
    "Title": "Domande \u0026 Risposte",
    "Image": null,
    "StartTime": "2019-12-13T18:00:00",
    "EndTime": "2019-12-13T18:30:00",
    "Abstract": null,
    "Level": 0,
    "Speakers": [],
    "WorkshopId": "fd14a523-1bcb-4782-a139-25e48dc4dcae"
  },
  {
    "WorkshopTrackId": "6df427ef-328b-40eb-8e25-207d913ae23b",
    "Title": "La rivoluzione di Blazor nello sviluppo di web-app",
    "Image": null,
    "StartTime": "2019-12-13T17:00:00",
    "EndTime": "2019-12-13T18:00:00",
    "Abstract": null,
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "fd14a523-1bcb-4782-a139-25e48dc4dcae"
  },
  {
    "WorkshopTrackId": "4e64da21-4fa1-492f-b59d-8391d4cffae2",
    "Title": "Uno sguardo allo sviluppo di Web API in ASP.NET Core ",
    "Image": null,
    "StartTime": "2019-12-13T16:00:00",
    "EndTime": "2019-12-13T17:00:00",
    "Abstract": null,
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "fd14a523-1bcb-4782-a139-25e48dc4dcae"
  },
  {
    "WorkshopTrackId": "b2b924bf-6d09-47a5-b60e-6fd7042465a0",
    "Title": "Video Sorpresa",
    "Image": null,
    "StartTime": "2019-12-13T14:30:00",
    "EndTime": "2019-12-13T15:00:00",
    "Abstract": "Abbiamo una piccola sorpresa in un video per chi sarà presente....",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "fd14a523-1bcb-4782-a139-25e48dc4dcae"
  },
  {
    "WorkshopTrackId": "fbcd0102-5b09-4c6d-b626-f00c4e0a2164",
    "Title": "Introduzione a .NET Core 3 e le novità di C# 8",
    "Image": null,
    "StartTime": "2019-12-13T15:00:00",
    "EndTime": "2019-12-13T16:00:00",
    "Abstract": null,
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "fd14a523-1bcb-4782-a139-25e48dc4dcae"
  },
  {
    "WorkshopTrackId": "0afb1426-c350-4a89-9301-db0d896dc15d",
    "Title": "Progettare software in linea con il nuovo regolamento GDPR",
    "Image": null,
    "StartTime": "2018-02-15T16:05:00",
    "EndTime": "2018-02-15T17:05:00",
    "Abstract": "La security nel software non è nulla di nuovo e gli articoli della GDPR sono stati chiaramente influenzati dalle prassi già consolidate in quest\u0027area.\r\nNel corso della sessione vedremo un parallelo tra le prassi già note di Microsoft SDL (Security Development Lifecycle) e i requisiti GDPR (General Data Protection Regulation), discutendo le differenze e quali possano essere le contromisure da mettere in campo prima della scadenza di maggio.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "275a1299-dd43-4791-96f4-3531d4dcb7f8"
  },
  {
    "WorkshopTrackId": "c7cdfe75-8a88-4c6c-95ed-72686b2c6e04",
    "Title": "Ritorno ai fondamenti",
    "Image": null,
    "StartTime": "2018-02-15T18:45:00",
    "EndTime": "2018-02-15T19:40:00",
    "Abstract": "L\u0027identificazione dei confini di sicurezza è uno dei punti fondamentali che deve essere svolto prima di scrivere codice, va quindi identificato in fase di architettura.\r\nQuali sono allora questi confini? Analizziamo quindi la più recente architettura del sistema operativo Windows che forse tutti non sanno sia evoluta in due kernel.\r\nNel corso della sessione vedremo i meccanismi utili a proteggere le nostre applicazioni e come poterli sfruttare nelle applicazioni reali.",
    "Level": 300,
    "Speakers": [],
    "WorkshopId": "275a1299-dd43-4791-96f4-3531d4dcb7f8"
  },
  {
    "WorkshopTrackId": "fcb4d217-33eb-4b31-8bbc-d1e69c899a20",
    "Title": "SQL Server \u0026 GDPR",
    "Image": null,
    "StartTime": "2018-02-15T17:10:00",
    "EndTime": "2018-02-15T18:40:00",
    "Abstract": "Con l\u0027avvicinarsi della scadenza per il recepimento del regolamento generale sulla protezione dei dati (GDPR, General Data Protection Regulation), ma anche per il continuo e preoccupante aumento del numero di crimini informatici, il tema della protezione dei dati diventa sempre più importante. Gli RDBMS sono tradizionalmente uno degli obiettivi principali di attacchi informatici e SQL Server offre svariate tecnologie sia per proteggere i dati in transito e a riposo, che per monitorare in maniera proattiva i tentativi di aggirare i meccanismi di protezione. Lungi dal voler esaurire l\u0027argomento GDPR, che spesso è più una questione di processi che di tecnologia, in questa sessione vedremo quali sono le tecnologie che possono aiutarci nel recepimento del regolamento scendendo più in dettaglio sulle nuove funzionalità introdotte con SQL Server 2016 e faremo anche alcuni cenni alle tecnologie per mitigare i rischi di perdita dei dati.",
    "Level": 300,
    "Speakers": [],
    "WorkshopId": "275a1299-dd43-4791-96f4-3531d4dcb7f8"
  },
  {
    "WorkshopTrackId": "40eaa028-13e2-4080-9cf6-0f49c90b45df",
    "Title": "Introduzione ",
    "Image": null,
    "StartTime": "2018-02-15T16:00:00",
    "EndTime": "2018-02-15T16:05:00",
    "Abstract": null,
    "Level": 1,
    "Speakers": [],
    "WorkshopId": "275a1299-dd43-4791-96f4-3531d4dcb7f8"
  },
  {
    "WorkshopTrackId": "610a3810-80a8-41d6-b0ce-bbdf91abb497",
    "Title": "Gestire Il Data Layer Attraverso Un Database Documentale: Esempi In Mongodb",
    "Image": "http://www.hostingtalk.it/wp-content/uploads/2013/11/mongodb_logo.png",
    "StartTime": "2015-03-03T19:00:00",
    "EndTime": "2015-03-03T20:00:00",
    "Abstract": "Negli ultimi anni grazie anche alla drastica riduzione dei costi dello storage ed al crescente bisogno di memorizzare sempre più grandi quantitativi di dati, sono tornati alla ribalta i database documentali, è quindi per noi developer necessario ed obbligatorio averne una conoscenza per poterli utilizzare nel momento giusto. In questa presentazione vedremo perchè vanno usati, dove e come... ci saranno anche esempi di codice, ovviamente con linguaggio C# .Net.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "399be155-60a5-4787-9ea6-3ea8be704dd0"
  },
  {
    "WorkshopTrackId": "9c814683-3f43-4e1a-9022-b3382f2a1d56",
    "Title": "L’utilizzo Di Frontend Basate Su Microsoft Office Utilizzando OOXml",
    "Image": "https://sharepointsamurai.files.wordpress.com/2014/04/2008040211105590dad1.gif",
    "StartTime": "2015-03-03T17:00:00",
    "EndTime": "2015-03-03T18:00:00",
    "Abstract": "Office OpenXML è il formato standard ISO DIS 29500 usato a partire da Office 2007 (file con estensione docx, xlsx e pptx). Microsoft fornisce un SDK basato sul Framework.NET che permette la generazione di documenti senza necessità di installare Office, aprendo così a una moltitudine di automazioni. Nel corso della presentazione verrà analizzato il formato del file, gli strumenti per poterlo manipolare e una serie di esempi su come generare o modificare documenti docx (Word) e xlsx (Excel). Infine, vista la popolarità del formato xlsx, verrà fatto un confronto con una libreria basata su questi strumenti e che consente la generazione degli spreadsheet ancora più rapidamente.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "399be155-60a5-4787-9ea6-3ea8be704dd0"
  },
  {
    "WorkshopTrackId": "b6e54b69-9d22-4c8e-a626-de4dd0afff5b",
    "Title": "Introduzione Alle Architetture Software Basate Su Eventi, Event Sourcing E CQRS Dalla Teoria Alla Pratica",
    "Image": "http://logofury.com/wp-content/uploads/2004/eske_CQRS.gif",
    "StartTime": "2015-03-03T18:00:00",
    "EndTime": "2015-03-03T19:00:00",
    "Abstract": "Sviluppare un Domain Model può nascondere alcune insidie: quando i comportamenti del nostro dominio iniziano a diventare complessi dobbiamo fare delle scelte strutturali, di performance, di design. Una soluzione è CQRS (Command and Query Responsibility Segregation), un\u0027architettura a stack asimmetrici che separa i comandi dalle queries di lettura. Ma CQRS spesso fa coppia con Event Sourcing e vedremo pro e contro nell\u0027utilizzare dabase documentali per persistere il Domain Model.",
    "Level": 400,
    "Speakers": [],
    "WorkshopId": "399be155-60a5-4787-9ea6-3ea8be704dd0"
  },
  {
    "WorkshopTrackId": "d21b574b-95a1-4733-9f38-77375cfd40e8",
    "Title": "Sviluppare Servizi Web Con WebApi E OData",
    "Image": "http://www.cloudtalk.it/wp-content/uploads/2012/05/logo-odata1.png",
    "StartTime": "2014-10-09T17:00:00",
    "EndTime": "2014-10-09T18:30:00",
    "Abstract": "Con la crescita del mercato dei device è cresciuta la necessità di creare servizi web in grado di erogare dati privi di rappresentazione HTML e lo stile architetturale REST è quello che risponde meglio a tale necessità. Nel mondo .NET le WebApi permettono di costruire servizi web REST-style con semplicità e potenza grazie ad una pipeline molto espandibile. Sopra questa solida API Microsoft ha sviluppato il protocollo oData, oggi standard OASIS, che permette di produrre rapidamente servizi di accesso ai dati in modalità CRUD. Nella sessione vedremo esempi dei due tipi di servizi, di cosa offra l\u0027estendibilità e degli utilizzi al di fuori dello scenario web.",
    "Level": 300,
    "Speakers": [],
    "WorkshopId": "36abf553-6b14-46e3-b81a-3fa8292d1c55"
  },
  {
    "WorkshopTrackId": "641567b2-2596-485c-b19c-4f85a5b9986b",
    "Title": "AngularJS In Practice",
    "Image": "https://lh6.googleusercontent.com/-TlY7amsfzPs/T9ZgLXXK1cI/AAAAAAABK-c/Ki-inmeYNKk/w749-h794/AngularJS-Shield-large.png",
    "StartTime": "2014-10-09T18:30:00",
    "EndTime": "2014-10-09T20:00:00",
    "Abstract": "Vista la diffusione e la proliferazione di frameworks JavaScript full stack e la sempre crescente necessità di avere applicazioni responsive e multi platform, volevamo condividere l\u0027esperienza day by day di uno sviluppatore che ha già lavorato con uno dei più robusti e in voga: angularjs. Una overview su pattern, directives, controllers, interazione con un back-end json , gli strumenti per lo sviluppo e l\u0027integrazione con la libreria Bootstrap.",
    "Level": 400,
    "Speakers": [],
    "WorkshopId": "36abf553-6b14-46e3-b81a-3fa8292d1c55"
  },
  {
    "WorkshopTrackId": "33f0a727-1323-492d-9fd6-7031f427fd89",
    "Title": "Entity Framework 4.1 - Code First",
    "Image": null,
    "StartTime": "2011-07-01T18:30:00",
    "EndTime": "2011-07-01T19:30:00",
    "Abstract": "Con la nuova versione di Entity Framework sono state introdotte due nuove funzionalità: l\u0027API DbContext e \u0022Code First\u0022. Il primo è un\u0027astrazione semplificata dell\u0027ObjectContest esistente, ottimizzata per attività comuni e modelli di programmazione. La seconda: \u0022Code First\u0022 è un nuovo modello di sviluppo di Entity Framework che si affianca ai due modelli esistenti \u0022Database First\u0022 e \u0022Model First\u0022; Code First permette di definire il modello mediante classi CLR senza l\u0027utilizzo di un designer. Nella sessione vedremo nei dettagli come scrivere mapping con \u0022Code First\u0022.\r\n\r\n\r\nSeguirà una tavola rotonda con discussioni sugli argomenti di Entity Framework 4.1 e sul precedente workshop WCF vNext\r\n",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "99bf031c-7768-4902-8efb-5b40dca38282"
  },
  {
    "WorkshopTrackId": "95a66b0f-e306-4fc4-864e-d5be9241a34e",
    "Title": "Applicazioni web, come farle oggi",
    "Image": null,
    "StartTime": "2022-04-22T18:30:00",
    "EndTime": "2022-04-22T19:30:00",
    "Abstract": " Quale tecnologia scegliere è forse la domanda più frequente quando si vuole realizzare una nuova applicazione web, in questa sessione vedremo una panoramica degli strumenti e delle metodologie attuali per lo sviluppo di applicazioni web analizzandone le principali differenze. Parleremo di Web Api, ASP.NET, sviluppo client ma anche di templates, frameworks, e un po\u0060 di css. ",
    "Level": 0,
    "Speakers": [],
    "WorkshopId": "ab94d719-785f-4878-8284-6e3b276179e3"
  },
  {
    "WorkshopTrackId": "0dfa9496-6f45-4a57-ade3-e415c2826fa1",
    "Title": "Come è cambiato lo sviluppo in .NET",
    "Image": null,
    "StartTime": "2022-04-22T17:30:00",
    "EndTime": "2022-04-22T18:30:00",
    "Abstract": "Gli ultimi anni hanno visto una vera e propria rivoluzione nel modo di sviluppare applicazioni (sia lato server che client). In questa sessione vedremo una panoramica degli strumenti da usare e quali librerie oggi abbiamo a disposizione per accorciare i tempi di sviluppo in modo molto significativo.",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "ab94d719-785f-4878-8284-6e3b276179e3"
  },
  {
    "WorkshopTrackId": "fddb9495-7b02-4367-a9c6-e70f0efd9bd8",
    "Title": "Introduzione",
    "Image": null,
    "StartTime": "2022-04-22T17:00:00",
    "EndTime": "2022-04-22T17:30:00",
    "Abstract": "Introduzione all\u0027evento, presidente :NET Liguria Raffaele Rialdi",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "ab94d719-785f-4878-8284-6e3b276179e3"
  },
  {
    "WorkshopTrackId": "b4484268-9a4f-4dff-b799-ea3ecc829aaa",
    "Title": "Entity Framework 7",
    "Image": null,
    "StartTime": "2022-12-14T16:45:00",
    "EndTime": "2022-12-14T17:40:00",
    "Abstract": "Entity Framework 7 è il successore di Entity Framework Core 6 e non di Entity Framework 6 come ci porterebbe a pensare, come per le ultime versioni i cambiamenti non sono molti, ma la qualità e i miglioramenti di questo ORM sono sempre superiori e in questa sessione vedremo le piccole novità introdotte e i miglioramenti in tante sue parti. Nelle performance, nella completa gestione dell\u0027ereditarietà, nell\u0027introduzione delle colonne JSON, delle Bulk update e delete.",
    "Level": 1,
    "Speakers": [],
    "WorkshopId": "85f7131f-7d9d-46d6-913f-738a31edbaf8"
  },
  {
    "WorkshopTrackId": "1d59ae48-f836-4066-ac9a-da04649a98e5",
    "Title": "Da WebAssembly a Blazor... e ritorno",
    "Image": null,
    "StartTime": "2022-12-14T17:45:00",
    "EndTime": "2022-12-14T18:40:00",
    "Abstract": "Grazie a Blazor possiamo eseguire codice .NET all\u0027interno di qualsiasi browser, conservando i paradigmi classici delle applicazioni ASP.NET. La tecnologia che lo permette è WebAssembly, una sandbox standard che consente di interoperare da moltissimi linguaggi con Javascript ed il modello ad oggetti del browser.\r\n\r\nCon .NET 7 Microsoft ha cominciato a guardare oltre al browser ed utilizzare WebAssembly per poter interoperare con Javascript anche in scenari diversi dal web.\r\n\r\nNella prima parte vediamo cosa ha portato la nuova revisione di .NET per Blazor 7, mentre nella seconda parte approfondiremo WebAssembly, che si sta mostrando efficace anche in altri contesti al di fuori del browser.",
    "Level": 1,
    "Speakers": [],
    "WorkshopId": "85f7131f-7d9d-46d6-913f-738a31edbaf8"
  },
  {
    "WorkshopTrackId": "692f6196-f0c4-43be-8e9f-89bc423c2bd0",
    "Title": "Introduzione e presentazione evento",
    "Image": null,
    "StartTime": "2022-12-14T14:30:00",
    "EndTime": "2022-12-14T14:50:00",
    "Abstract": null,
    "Level": 0,
    "Speakers": [],
    "WorkshopId": "85f7131f-7d9d-46d6-913f-738a31edbaf8"
  },
  {
    "WorkshopTrackId": "0b1e3e54-00ea-4c17-bd46-a2b5305c1a82",
    "Title": "Q\u0026A",
    "Image": null,
    "StartTime": "2022-12-14T18:40:00",
    "EndTime": "2022-12-14T19:00:00",
    "Abstract": null,
    "Level": 1,
    "Speakers": [],
    "WorkshopId": "85f7131f-7d9d-46d6-913f-738a31edbaf8"
  },
  {
    "WorkshopTrackId": "efd2e349-8bcf-41f4-88df-d1fbe87d2539",
    "Title": "Le novità in C# 11 e .NET 7",
    "Image": null,
    "StartTime": "2022-12-14T14:50:00",
    "EndTime": "2022-12-14T15:40:00",
    "Abstract": "Il team di .NET è riuscito a stupire ancora una volta con interessantissime novità sia sul fronte di C# che del runtime e delle librerie.\r\n\r\nLa vera chiave di lettura di questa veloce evoluzione è di aumentare drasticamente la produttività e la performance delle nostre applicazioni e non c\u0027è dubbio che ci siano riusciti.\r\n\r\nTra gli argomenti che vedremo ci sono \u0022Generic Math\u0022, le novità di System.Text.Json, i required members di C#, il nuovo modo di chiamare codice nativo, i generatori di regular expressions, i nuovi metodi di System.IO.Stream e le numerosissime novità sulla performance che regalano velocità alle nostre applicazioni.",
    "Level": 1,
    "Speakers": [],
    "WorkshopId": "85f7131f-7d9d-46d6-913f-738a31edbaf8"
  },
  {
    "WorkshopTrackId": "f51cf0be-f7b0-49a0-993c-059aed945069",
    "Title": "Migrare da AspNet a AspNet Core utilizzando Yarp",
    "Image": null,
    "StartTime": "2022-12-14T15:45:00",
    "EndTime": "2022-12-14T16:40:00",
    "Abstract": "In questa sessione verranno affrontate le tematiche relative alla migrazione di applicazioni Asp ad AspNet Core. Nella prima parte verranno descritti alcuni vantaggi dell\u0027adozione del nuovo framework (sicurezza, multipiattaforma, l\u0027architettura basata su middleware, performance). Inoltre, verranno descritte alcune novità legate al linguaggio c#11 e l\u0027utilizzo di alcune estensioni di visual studio code / visual studio dedicate alle migrazioni. Verranno analizzate tre possibili metodologie di migrazione, ed in particolare analizzeremo il pattern \u0022Strangle Fig Pattern\u0022 che consente di far coesistere codice asp.net con codice aspnet core durante tutte le fasi di migrazione. Utilizzando YARP vedremo un esempio concreto di come realizzare una semplice migrazione, utilizzando alcuni tool messi a disposizione da Microsoft. ",
    "Level": 1,
    "Speakers": [],
    "WorkshopId": "85f7131f-7d9d-46d6-913f-738a31edbaf8"
  },
  {
    "WorkshopTrackId": "b0aab91a-94a1-4ddd-bcba-0bfbb662c747",
    "Title": "[Main Room] Rendiamo intelligenti le nostre app con i Cognitive Services",
    "Image": null,
    "StartTime": "2018-06-19T17:55:00",
    "EndTime": "2018-06-19T18:35:00",
    "Abstract": "Riconoscere i contesti, le emozioni, i volti e i testi: questa è solo una piccola parte della potenza dei Cognitive Services di Microsoft, che permettono di integrare con estrema facilità potenti algoritmi di intelligenza artificiale nei nostri sistemi. Nel corso di questa sessione mostreremo come sfruttarli con Xamarin per dare un vero valore aggiunto alle nostre app.",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "d6112500-8a5d-44c6-8a22-74b290b571f0"
  },
  {
    "WorkshopTrackId": "693d2f01-d228-4006-bb48-277ec4f90e3d",
    "Title": "[Main Room] Android Programming-Getting started",
    "Image": null,
    "StartTime": "2018-06-19T16:10:00",
    "EndTime": "2018-06-19T17:00:00",
    "Abstract": "Lo sviluppo di una applicazione android nativa attraverso android studio. Nel talk vedremo come realizzare una semplice APP, che permetta di visualizzare e inviare dati a Firebase.",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "d6112500-8a5d-44c6-8a22-74b290b571f0"
  },
  {
    "WorkshopTrackId": "7397d946-6825-4ec0-86a0-404a7fce56ae",
    "Title": "[Main Room] Azure Mobile App",
    "Image": null,
    "StartTime": "2018-06-19T17:05:00",
    "EndTime": "2018-06-19T17:50:00",
    "Abstract": "Utilizzo degli Azure Mobile APp, e relativo SDK, per realizzare una app cross-platform dotata di autenticazione e utilizzo dei dati in un contesto offline sync",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "d6112500-8a5d-44c6-8a22-74b290b571f0"
  },
  {
    "WorkshopTrackId": "db66f337-5320-4fbc-907d-4be841d376f7",
    "Title": "[Secondary Room] Sviluppo di app mobile per Augmented Reality",
    "Image": null,
    "StartTime": "2018-06-19T16:10:00",
    "EndTime": "2018-06-19T17:00:00",
    "Abstract": "Introduzione sullo sviluppo di app mobile per Augmented Reality con  demo  in Unity e Vuforia.",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "d6112500-8a5d-44c6-8a22-74b290b571f0"
  },
  {
    "WorkshopTrackId": "06721dbb-633a-4432-b01a-4ec6b1b7bca5",
    "Title": "[Secondary Room] Introduzione a React Native",
    "Image": null,
    "StartTime": "2018-06-19T17:05:00",
    "EndTime": "2018-06-19T17:50:00",
    "Abstract": "React Native è un framework Javascript basato su ReactJS per lo sviluppo crossplatform di applicazioni mobile.\r\nNel talk vedremo i prinicipi di base ed alcuni esempi di funzionamento del framework.",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "d6112500-8a5d-44c6-8a22-74b290b571f0"
  },
  {
    "WorkshopTrackId": "a21ce5ac-f721-4a5a-8bce-6aaed604a9a1",
    "Title": "[Sencodary Room] Sviluppo di una app mobile con Nativescript ",
    "Image": null,
    "StartTime": "2018-06-19T17:55:00",
    "EndTime": "2018-06-19T18:35:00",
    "Abstract": "Nativescript: setup iniziale e realizzazione pratica di una app",
    "Level": 0,
    "Speakers": [],
    "WorkshopId": "d6112500-8a5d-44c6-8a22-74b290b571f0"
  },
  {
    "WorkshopTrackId": "d5b3e58e-edf5-4ff5-9709-9f692dd1af70",
    "Title": "[Secondary Room] Ionic Framework – Progressive and Native apps in poche mosse",
    "Image": null,
    "StartTime": "2018-06-19T15:05:00",
    "EndTime": "2018-06-19T15:55:00",
    "Abstract": "Ionic è un framework Open Source per lo sviluppo di app mobile basato su Cordova e Angular, ed eseguita all’interno di una applicazione nativa per interagire con le funzionalità del dispositivo.\r\nVedremo come creare un nuovo progetto e le principali linee guida da adottare.",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "d6112500-8a5d-44c6-8a22-74b290b571f0"
  },
  {
    "WorkshopTrackId": "c7ae5232-5495-4c9d-99d1-869001b60249",
    "Title": "[Main Room] Sviluppi mobile con Visual Studio OnLine",
    "Image": null,
    "StartTime": "2018-06-19T15:05:00",
    "EndTime": "2018-06-19T15:55:00",
    "Abstract": "Introduzione a .NET standard, AppCenter e sviluppo mobile con Visual Studio Online",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "d6112500-8a5d-44c6-8a22-74b290b571f0"
  },
  {
    "WorkshopTrackId": "579e67a2-a30a-4dbf-92b0-86a283ccb2d3",
    "Title": "[Secondary Room] Introduzione alle Progressive Web App",
    "Image": null,
    "StartTime": "2018-06-19T14:10:00",
    "EndTime": "2018-06-19T15:00:00",
    "Abstract": "Breve introduzione al mondo delle Progressive Web App con esempi di sviluppo \r\nbasato sulla libreria per configurare Service Worker in Javascript.",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "d6112500-8a5d-44c6-8a22-74b290b571f0"
  },
  {
    "WorkshopTrackId": "fc2c81dd-d58d-4497-b485-9541cb618065",
    "Title": "[Main Room] Introduzione",
    "Image": null,
    "StartTime": "2018-06-19T14:00:00",
    "EndTime": "2018-06-19T14:10:00",
    "Abstract": null,
    "Level": 1000,
    "Speakers": [],
    "WorkshopId": "d6112500-8a5d-44c6-8a22-74b290b571f0"
  },
  {
    "WorkshopTrackId": "54e10a59-f903-46d5-9f8f-fe7ca06ddf9b",
    "Title": "[Main Room] Xamarin sotto il cofano",
    "Image": null,
    "StartTime": "2018-06-19T14:10:00",
    "EndTime": "2018-06-19T15:00:00",
    "Abstract": "Xamarin.iOS e Xamarin.Android abilitano lo sviluppo di applicazioni mobile native cross-platform utilizzando C# (o F#). In questa sessione vedremmo come vengano implementate queste funzionalità, perché’ le applicazioni sono native e quali sono gli aspetti da tenere in conto in un ambiente dove il runtime .Net viene iniettato dentro il processo nativo della applicazione.",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "d6112500-8a5d-44c6-8a22-74b290b571f0"
  },
  {
    "WorkshopTrackId": "2d0b57a4-4e4d-43cd-afab-ff396e5a163f",
    "Title": "[Main Room] Conclusione",
    "Image": null,
    "StartTime": "2018-06-19T18:35:00",
    "EndTime": "2018-06-19T18:40:00",
    "Abstract": null,
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "d6112500-8a5d-44c6-8a22-74b290b571f0"
  },
  {
    "WorkshopTrackId": "abf86395-3729-4543-bd50-d1109a4e3d31",
    "Title": " Il nuovo volto dello standard C\u002B\u002B nelle applicazioni UWP e DirectX.",
    "Image": null,
    "StartTime": "2017-03-09T16:35:00",
    "EndTime": "2017-03-09T17:40:00",
    "Abstract": "Dopo una breve introduzione ai grossi cambiamenti che sono arrivati nello standard del linguaggio C\u002B\u002B, vedremo come poter realizzare applicazioni Windows per sfruttare i cognitive service di Azure da C\u002B\u002B.\r\n\r\nInfine entreremo nel mondo di DirectX con piacevoli sorprese rispetto al passato, allo scopo di capire quali siano le alternative al mondo di Unity",
    "Level": 300,
    "Speakers": [],
    "WorkshopId": "efdb07d8-5993-485e-94b3-7bd84dbca18a"
  },
  {
    "WorkshopTrackId": "9335d93a-c80f-4d12-9760-f69958902829",
    "Title": "Cognitive Services: dai alle tue app un lato umano",
    "Image": null,
    "StartTime": "2017-03-09T15:25:00",
    "EndTime": "2017-03-09T16:30:00",
    "Abstract": "Riconoscere i contesti, le emozioni, i volti e i testi: questa è solo una piccola parte della potenza dei Cognitive Services. Sfruttando tali servizi possiamo realizzare applicazioni in grado di vedere il mondo. Nel corso di questa sessioni mostreremo come sfruttarli in un ambiente cross-platform con Xamarin e come realizzare un dispositivo wearable basato su Windows 10 IoT Core in grado di aiutare le persone con difficoltà visive.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "efdb07d8-5993-485e-94b3-7bd84dbca18a"
  },
  {
    "WorkshopTrackId": "2efa9c3f-992f-4839-b510-6f65c85724da",
    "Title": "Demo Hololens e Q\u0026A",
    "Image": null,
    "StartTime": "2017-04-13T18:50:00",
    "EndTime": "2017-04-13T19:00:00",
    "Abstract": "Dalla teoria alla pratica...",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "efdb07d8-5993-485e-94b3-7bd84dbca18a"
  },
  {
    "WorkshopTrackId": "4b12e03b-ad34-400a-b4e6-783c53f77424",
    "Title": "Introduzione",
    "Image": null,
    "StartTime": "2017-03-09T14:00:00",
    "EndTime": "2017-03-09T14:15:00",
    "Abstract": "Introduzione all\u0027evento a cura di Raffaele Rialdi (DotNetLiguria) e Claudio Firpo (Ordine degli Ingegneri di Genova)",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "efdb07d8-5993-485e-94b3-7bd84dbca18a"
  },
  {
    "WorkshopTrackId": "773f64fb-07b6-4eef-a1ab-b904719028ef",
    "Title": " Introduzione ad Hololens e Holographic platform",
    "Image": null,
    "StartTime": "2017-03-09T14:15:00",
    "EndTime": "2017-03-09T15:20:00",
    "Abstract": "Vediamo cosa \u0022C\u0027e\u0027 dentro\u0022 a Hololens, come funziona e qual\u0027e\u0027 la piattaforma di sviluppo su cui si basa, approfondiamo anche la conoscenza con la holographic platform che caratterizzera\u0027 i device per la realta\u0027 aumentata, virtuale e mista nel prossimo futuro..",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "efdb07d8-5993-485e-94b3-7bd84dbca18a"
  },
  {
    "WorkshopTrackId": "b073e334-3d07-4484-90cb-1d851f1be8e2",
    "Title": "Hololens e la realtà aumentata nel contesto industriale",
    "Image": null,
    "StartTime": "2017-04-13T17:45:00",
    "EndTime": "2017-04-13T18:50:00",
    "Abstract": "La Realtà Aumentata sarà uno dei trend topic delle nuove tecnologie interattive. In questa sessione dopo una breve introduzione sulle varie realtà ci concentreremmo su Hololens, il device di realtà autentata di Microsoft. Dopo averne esaminato le caratteristiche svilupperemo una applicazione sfruttando il middleware di gioco Unity.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "efdb07d8-5993-485e-94b3-7bd84dbca18a"
  },
  {
    "WorkshopTrackId": "b7e5e24f-8b4d-4a8b-9e92-61d4143b3b8d",
    "Title": "Introduzione a Visual Studio LightSwitch 2011",
    "Image": null,
    "StartTime": "2012-01-27T18:00:00",
    "EndTime": "2012-01-27T19:00:00",
    "Abstract": "Visual Studio LightSwitch 2011 è il nuovo tool di casa Microsoft per lo sviluppo rapido di applicazioni line-of-business moderne e scalabili per il desktop, il Web, la Cloud. In questa sessione verrà introdotto LightSwitch e vedremo come sia semplice e veloce creare applicazioni data-centric con tecniche coding-optional e in cui l’unico codice che verrà scritto è l’unico codice che è possibile scrivere in LightSwitch: la gestione della logica di business.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "96869722-9aa7-4ef6-be1b-7d6139b0a37f"
  },
  {
    "WorkshopTrackId": "00f35e81-f3c4-4f93-a022-a9dd45e06cb8",
    "Title": "Roundtable \u0022Il futuro di Silverlight\u0022",
    "Image": null,
    "StartTime": "2012-01-27T17:00:00",
    "EndTime": "2012-01-27T18:00:00",
    "Abstract": "Discussione aperta tra tutti i partecipanti. Tavola rotonda sul futuro di Silverlight e sulle tecnologie di sviluppo client e web. Temi centrali: Silverlight vs Html5, Kit di sviluppo per applicazioni mobile (phonegap, etc.), Silverlight vs WinRT vs WPF per lo sviluppo Windows, ecc.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "96869722-9aa7-4ef6-be1b-7d6139b0a37f"
  },
  {
    "WorkshopTrackId": "e35f2c10-edca-4c5f-a65a-cccccdd424ce",
    "Title": "Writing bug-proof code using Code Contracts",
    "Image": null,
    "StartTime": "2012-01-27T19:00:00",
    "EndTime": "2012-01-27T20:00:00",
    "Abstract": "Fare testing oggi non è semplice e spesso manca tempo e risorse per scrivere test approfonditi o per lo meno essenziali. I *code contracts *sono uno strumento che mira a rendere più robusto il codice assicurando la validità dei parametri e del risultato di una funzione, o lo stato corretto di un oggetto, permettendo di avere informazioni automatizzate sul suo utilizzo.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "96869722-9aa7-4ef6-be1b-7d6139b0a37f"
  },
  {
    "WorkshopTrackId": "02ad67a3-2ab7-49d7-b49a-c428beaa79af",
    "Title": "I vantaggi di ASP.NET MVC",
    "Image": null,
    "StartTime": "2012-09-28T19:00:00",
    "EndTime": "2012-09-28T20:00:00",
    "Abstract": "Il model-View-Controller sviluppato da Microsoft, nasce come aggiunta ad ASP.NET, offrendo un\u0027alternativa al modello ASP.NET Web Forms.  Utilizzato quindi per la creazione di applicazioni web, in breve tempo e maturando nelle versioni, oggi si può dire che abbia preso il posto  del classico Web Forms dando allo sviluppatore una libertà di sviluppo mai avuta prima con tecnologia Microsoft.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "a1fdfa6a-1607-45d5-92a6-8263e344afa7"
  },
  {
    "WorkshopTrackId": "8b540163-a24c-4abc-9467-92540d691569",
    "Title": "Roundtable",
    "Image": null,
    "StartTime": "2012-09-28T17:00:00",
    "EndTime": "2012-09-28T18:00:00",
    "Abstract": "nosql vs database relazionali.\r\nDiscussione aperta tra tutti i partecipanti.",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "a1fdfa6a-1607-45d5-92a6-8263e344afa7"
  },
  {
    "WorkshopTrackId": "018fdb53-9a26-4fe6-b2fa-880442f1bf55",
    "Title": "NoSql: come, quando e perché",
    "Image": null,
    "StartTime": "2012-09-28T18:00:00",
    "EndTime": "2012-09-28T19:00:00",
    "Abstract": "Obiettivo della sessione è confrontare sul campo vantaggi e svantaggi dei modelli relazione e documentale, mettendo a confronto il modello relazionale con quello documentale. Affronteremo le complessità e i vantaggi che il modello documentale offre e capiremo quando ha senso scegliere uno piuttosto che l\u0027altro o quando ha molto senso farli convivere per sfruttare i vantaggi offerti da entrambi i modelli. Spazieremo da RavenDB a MongoDB ad Azure Table Storage.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "a1fdfa6a-1607-45d5-92a6-8263e344afa7"
  },
  {
    "WorkshopTrackId": "0df62d32-fff1-4ccf-b19f-49da448f7b2c",
    "Title": "Roundtable - Sviluppo nativo o managed: quale futuro ?",
    "Image": "http://sivertimes.com/wp-content/uploads/2015/04/round_table_meeting_.jpg",
    "StartTime": "2013-04-05T16:30:00",
    "EndTime": "2013-04-05T17:30:00",
    "Abstract": "Con l’approvazione dello standard C\u002B\u002B11 e di ulteriori novità nel futuro C\u002B\u002B14 lo sviluppo nativo ha ripreso vigore non solo per motivi di performance o di consumo della batteria dei dispositivi portatili. Cosa spaventa lo sviluppatore nell’affrontare lo sviluppo nativo? Sintassi, librerie, intellisense, compilatore, tools o produttività? Nel corso della roundtable raccoglieremo suggerimenti su un eventuale futuro evento dedicato al mondo nativo).",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "d4a675b7-e631-4201-a55e-8778e2d8edf2"
  },
  {
    "WorkshopTrackId": "c890d21b-7420-40e6-be54-10e8db0de589",
    "Title": "HTML5 - Web (r)evolution",
    "Image": "http://www.w3.org/html/logo/downloads/HTML5_Badge_512.png",
    "StartTime": "2013-04-05T17:30:00",
    "EndTime": "2013-04-05T18:30:00",
    "Abstract": "Il nuovo standard HTML non introduce soltanto nuovi tags, ma un modo profondamente diverso di approcciare allo sviluppo di pagine web. In questa sessione cercheremo di analizzare le fondamentali differenze con lo standard precedente per arrivare alle ragioni che stanno dietro a tali cambiamenti.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "d4a675b7-e631-4201-a55e-8778e2d8edf2"
  },
  {
    "WorkshopTrackId": "b32f6829-3a8b-437a-8d7a-3bd8c1d98913",
    "Title": "Real-Time With ASP.NET con SignalR.",
    "Image": "http://blogs.microsoft.co.il/gadib/wp-content/uploads/sites/1318/2014/09/signalr.png",
    "StartTime": "2013-04-05T19:15:00",
    "EndTime": "2013-04-05T20:00:00",
    "Abstract": "Al giorno d\u0027oggi si cerca di portare tutto quello che era applicazione desktop su web, fino a ieri il real time era una nota dolente, oggi qualcosa è cambiato e possiamo pensare di avere un sistem real time anche su web. SignalR è una libreria che permette le notifiche in real-time sul web verso client desktop, brower di vecchia e nuova generazione e dispositivi mobile. Che siano disponibili le websocket o meno SignalR fornisce in modo trasparente la sua funzionalità senza richiedere alcuna modifica al codice.",
    "Level": 300,
    "Speakers": [],
    "WorkshopId": "d4a675b7-e631-4201-a55e-8778e2d8edf2"
  },
  {
    "WorkshopTrackId": "6fb3e94d-c49a-4fc5-86b9-f8688a7d58ea",
    "Title": "Knockout – Dynamic Javascript UI attraverso il pattern MVVM",
    "Image": "http://www.edgewater-consulting.com/SiteCollectionImages/Article%20Page%20Images/knockoutjs-banner.jpg",
    "StartTime": "2013-04-05T18:30:00",
    "EndTime": "2013-04-05T19:15:00",
    "Abstract": "Il nuovo standard HTML non introduce soltanto nuovi tags, ma un modo profondamente diverso di approcciare allo sviluppo di pagine web. In questa sessione cercheremo di analizzare le fondamentali differenze con lo standard precedente per arrivare alle ragioni che stanno dietro a tali cambiamenti.",
    "Level": 300,
    "Speakers": [],
    "WorkshopId": "d4a675b7-e631-4201-a55e-8778e2d8edf2"
  },
  {
    "WorkshopTrackId": "e3307565-b95b-424a-a3d6-3bf8dee340e0",
    "Title": "Migrare da AspNet a AspNet Core utilizzando Yarp",
    "Image": null,
    "StartTime": "2023-01-27T15:45:00",
    "EndTime": "2023-01-27T16:40:00",
    "Abstract": "Partendo dai vantaggi che sono stati introdotti dal nuovo framework (sicurezza, multipiattaforma, architettura basata su middleware, performance) e dalle novità legate al linguaggio C#11 verranno analizzate alcune estensioni di Visual studio code / Visual studio dedicate alle migrazioni. Nel corso della sessione verranno analizzate tre possibili metodologie di migrazione, soffermandoci in particolare sul pattern \u0022Strangle Fig Pattern\u0022 che consente di far coesistere codice ASP.Net con codice ASP.NET Core durante tutte le fasi di migrazione. Infine, utilizzando YARP vedremo un esempio concreto di come realizzare una semplice migrazione, con l\u0027utilizzo di alcuni tool messi a disposizione da Microsoft.",
    "Level": 1,
    "Speakers": [],
    "WorkshopId": "88376954-190c-4456-960b-8b1635c634e2"
  },
  {
    "WorkshopTrackId": "3488f99e-a814-4961-9344-3ebfa814bc32",
    "Title": "Introduzione e presentazione evento",
    "Image": null,
    "StartTime": "2023-01-27T14:30:00",
    "EndTime": "2023-01-27T14:50:00",
    "Abstract": null,
    "Level": 1,
    "Speakers": [],
    "WorkshopId": "88376954-190c-4456-960b-8b1635c634e2"
  },
  {
    "WorkshopTrackId": "11022724-c6ce-4b01-8a61-23615e06f725",
    "Title": "Le novità in C# 11 e .NET 7",
    "Image": null,
    "StartTime": "2023-01-27T14:50:00",
    "EndTime": "2023-01-27T15:40:00",
    "Abstract": "Il team di .NET è riuscito a stupire ancora una volta con interessantissime novità sia sul fronte di C# che del runtime e delle librerie. La vera chiave di lettura di questa veloce evoluzione è di aumentare drasticamente la produttività e la performance delle nostre applicazioni e non c\u0027è dubbio che ci siano riusciti. Tra gli argomenti che vedremo ci sono \u0022Generic Math\u0022, le novità di System.Text.Json, i required members di C#, il nuovo modo di chiamare codice nativo, i generatori di regular expressions, i nuovi metodi di System.IO.Stream e le numerosissime novità sulla performance che regalano velocità alle nostre applicazioni.",
    "Level": 1,
    "Speakers": [],
    "WorkshopId": "88376954-190c-4456-960b-8b1635c634e2"
  },
  {
    "WorkshopTrackId": "ce581335-e298-4202-aa81-1774d818fbcf",
    "Title": "Entity Framework 7",
    "Image": null,
    "StartTime": "2023-01-27T16:45:00",
    "EndTime": "2023-01-27T17:40:00",
    "Abstract": "Entity Framework 7 è il successore di Entity Framework Core 6 e non di Entity Framework 6 come ci porterebbe a pensare, come per le ultime versioni i cambiamenti non sono molti, ma la qualità e i miglioramenti di questo ORM sono sempre superiori e in questa sessione vedremo le piccole novità introdotte e i miglioramenti in tante sue parti. Nelle performance, nella completa gestione dell\u0027ereditarietà, nell\u0027introduzione delle colonne JSON, delle Bulk update e delete.",
    "Level": 1,
    "Speakers": [],
    "WorkshopId": "88376954-190c-4456-960b-8b1635c634e2"
  },
  {
    "WorkshopTrackId": "d6270bab-205a-4459-9f2c-01761aa94780",
    "Title": "Q\u0026A",
    "Image": null,
    "StartTime": "2023-01-27T18:40:00",
    "EndTime": "2023-01-27T19:00:00",
    "Abstract": null,
    "Level": 1,
    "Speakers": [],
    "WorkshopId": "88376954-190c-4456-960b-8b1635c634e2"
  },
  {
    "WorkshopTrackId": "0b7260db-4040-40ea-b1a5-5514228c1ac6",
    "Title": "Da WebAssembly a Blazor... e ritorno",
    "Image": null,
    "StartTime": "2023-01-27T17:45:00",
    "EndTime": "2023-01-27T18:40:00",
    "Abstract": "Blazor è lo strumento che permette di eseguire codice scritto in .NET all\u0027interno di qualsiasi browser, conservando i paradigmi classici delle applicazioni ASP.NET. La tecnologia che sottende questa possibilità è WebAssembly, che è una sandbox standard che consente di interoperare da moltissimi linguaggi con Javascript ed il modello ad oggetti del browser. Con .NET 7 Microsoft ha iniziato a \u0022guardare oltre\u0022 al semplice browser, permettendo di usare WebAssembly per interoperare con Javascript anche in scenari diversi dal web. Nella prima parte dell\u0027intervento vedremo le novità che interessano Blazor 7, mentre nella seconda parte approfondiremo WebAssembly e i suoi utilizzi anche in contesti al di fuori del browser.",
    "Level": 1,
    "Speakers": [],
    "WorkshopId": "88376954-190c-4456-960b-8b1635c634e2"
  },
  {
    "WorkshopTrackId": "109fac26-0769-4fd0-b317-850e77b5da58",
    "Title": "Le novità della prossima versione di Window Communication Foundation",
    "Image": null,
    "StartTime": "2011-05-27T18:30:00",
    "EndTime": "2011-05-27T20:00:00",
    "Abstract": "A partire dalla prossima versione WCF ci metterà a disposizione nuove librerie per permetterci un vero sviluppo cross-platform. Il primo filone riguarda i nuovi RIA services e un set di plugin jQuery. I RIA, nati per Silverlight, sono stati modificati in modo da poter essere utilizzati con la stessa direttamente da javascript e jQuery. Nel contempo un set di plugin jQuery ci permettono di avere template, binding, e molte altre caratteristiche che prima erano esclusiva di Silverlight.\r\n\r\nA contorno dello sviluppo web vedremo come sta evolvendo lo sviluppo dello standard Websockets di HTML5\r\n\r\nL\u0027altro interessante filone è quello delle nuove librerie WCF WebAPI che permettono di sfruttare completamente il protcollo HTTP in tutta la sua semantica. Durante la presentazione vedremo i perché di questa rilevanza e come funziona la pre-release delle librerie su cui Microsoft sta lavorando.\r\n",
    "Level": 300,
    "Speakers": [],
    "WorkshopId": "8fcac0da-44e0-44cc-9261-9ee3621e53e9"
  },
  {
    "WorkshopTrackId": "f5cec52c-2952-4c2c-adc5-2ea8b84e910d",
    "Title": "Il compilatore di C# diventa programmabile: il progetto Roslyn",
    "Image": "http://phoenixcoded.com/images/photo_1389636992_quiz_image_temp.png",
    "StartTime": "2014-06-05T18:00:00",
    "EndTime": "2014-06-05T19:00:00",
    "Abstract": "Il progetto Roslyn è il nuovo compilatore C# (e VB) dove le API interne sono diventate pubbliche e perciò qualsiasi applicazione può trarre beneficio dei servizi del compilatore. Paradossalmente il nuovo compilatore è più interessante per queste funzionalità rispetto alle nuove funzionalità che verranno aggiunte nell\u0027imminente C# 6.0. Grazie a Roslyn gli sviluppatori possono creare tool, analizzare i sorgenti ed estrarre dal codice sorgente di testo tutte le informazioni sintattiche e semantiche. Durante la sessione vedremo diversi esempi di come poter trarre beneficio di queste API, dai semplici tool alla più complessa integrazione con il refactoring di Visual Studio.",
    "Level": 300,
    "Speakers": [],
    "WorkshopId": "10a15e32-8206-431b-9bbb-bb5ebf952aa8"
  },
  {
    "WorkshopTrackId": "d9ffde8a-c97d-44e8-97d6-60721aa87ec4",
    "Title": "Novità per gli sviluppatori web con Visual Studio e ASP.NET.",
    "Image": "http://resource.thaicreate.com/upload/stock/20120503202942.gif",
    "StartTime": "2014-06-05T19:00:00",
    "EndTime": "2014-06-05T20:00:00",
    "Abstract": "Lo sviluppo web evolve rapidamente, e Visual Studio e ASP.NET cercano di tenere il passo, puntando ad essere sempre di più l\u0027IDE di riferimento per gli sviluppatori web di tutti i tipi. Daremo un\u0027occhiata alle nuove funzionalità introdotte in ASP.NET, le nuove idee in sviluppo web front-end, le novità delle Web Essentials e un po\u0027 del futuro ASP.NET.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "10a15e32-8206-431b-9bbb-bb5ebf952aa8"
  },
  {
    "WorkshopTrackId": "35f5e6cf-83de-4eea-b5cb-1f864a20a394",
    "Title": "Roundtable",
    "Image": "http://www.tlnt.com/media/2011/05/Roundtable-200x200.jpg",
    "StartTime": "2014-06-05T17:00:00",
    "EndTime": "2014-06-05T18:00:00",
    "Abstract": "Le novità presentate alla conferenza build 2014 di San Francisco",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "10a15e32-8206-431b-9bbb-bb5ebf952aa8"
  },
  {
    "WorkshopTrackId": "14e5cf55-6ce3-40a3-a466-4526a887a472",
    "Title": "Roundtable \u0022Overview della development platform per lo sviluppo Metro\u0022",
    "Image": null,
    "StartTime": "2012-04-13T17:00:00",
    "EndTime": "2012-04-13T18:00:00",
    "Abstract": "L\u0027evento inizia con una prima parte interattiva dove prenderemo in esame il nuovo Visual Studio 11 Beta 1 e le nuove caratteristiche per sviluppare applicazioni Metro.\r\nVedremo la struttura del codice creata dai wizard di Visual Studio e come questo possa essere facilmente modificato per supportare il prezioso pattern MVVM.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "2aead87a-4320-45d1-9376-bdae2e38973c"
  },
  {
    "WorkshopTrackId": "1eacf3fc-6b3c-4104-96ed-cbc52a9a26d5",
    "Title": "Il pattern asincrono in .NET 4.5 e in Metro",
    "Image": null,
    "StartTime": "2012-04-13T19:00:00",
    "EndTime": "2012-04-13T20:00:00",
    "Abstract": "C# 5.0 introduce due nuove keyword che rivoluzioneranno il modo di scrivere codice multithreading. Le novità toccano sia le attuali applicazioni desktop e server che il nuovo mondo Metro dove le funzioni di libreria che potrebbero impiegare più di 50ms sono esposte solo come asincrone.\r\nLa sessione comincerà con una veloce panoramica sui Task già presenti nel Framework 4.0.\r\n\r\nQuindi vedremo nel dettaglio come si usano le keywork async/await, e diversi casi d\u0027uso classici come la gestione delle eccezioni, l\u0027annullamento dell\u0027esecuzione, la gestione del progresso ed altri interessanti usi.\r\n",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "2aead87a-4320-45d1-9376-bdae2e38973c"
  },
  {
    "WorkshopTrackId": "8f3e8665-0780-4c84-be2d-cc782a450f48",
    "Title": "WinRT beta 1. La piattaforma è pronta",
    "Image": null,
    "StartTime": "2012-04-13T18:00:00",
    "EndTime": "2012-04-13T19:00:00",
    "Abstract": "La sessione inizierà con una rapida panoramica all\u0027architettura di WinRT.\r\nProseguiremo quindi analizzando il codice delle demo già viste durante la roundtable per capire le motivazioni e le implicazioni a livello di architettura del Windows Runtime.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "2aead87a-4320-45d1-9376-bdae2e38973c"
  },
  {
    "WorkshopTrackId": "98c6176b-08bf-41df-89e1-a7d6ef126f0f",
    "Title": "Windows Phone 8 e Windows 8.1 Store apps – Uno scenario Line of Business",
    "Image": "http://www.digitato.it/files/Windows-Phone-8.jpg",
    "StartTime": "2013-12-05T18:30:00",
    "EndTime": "2013-12-05T20:00:00",
    "Abstract": "“Non solo consumer” è il tema di questa sessione dove le nuove feature presenti in Windows Phone 8 e in Windows 8.1 permettono di gestire uno scenario LOB. Attraverso il pieno supporto a Bluetooth, NFC, HID e MultiView vedremo come gestire facilmente il processo che dal picking di magazzino porta alla generazione di un documento di trasporto. Una sessione ricca di codice per quello che vuole esse-re un case study che integra un’ampia gamma di novità (Windows Store apps, Windows Phone 8 apps, SignalR and more)! ",
    "Level": 300,
    "Speakers": [],
    "WorkshopId": "96915916-61ef-4a96-aaa9-dcd6a6670a6c"
  },
  {
    "WorkshopTrackId": "614c9e8e-db75-46f4-a7d8-5e4fc2dd673a",
    "Title": "Le novità di WinRT in Windows 8.1",
    "Image": "https://miapple.me/wp-content/uploads/2013/07/Windows-8.1-Logo.jpg",
    "StartTime": "2013-12-05T17:00:00",
    "EndTime": "2013-12-05T18:30:00",
    "Abstract": "Grazie all’aggiornamento gratuito a Windows 8.1 ci sono circa 5000 nuove API a disposizione degli sviluppatori di Windows Store applications. Durante la sessione vedremo innanzitutto i meccanismi che permettono a WinRT di poter evolvere nel versioning senza causare problemi di retro-compatibilità. Scenderemo poi nei dettagli per analizzare le tante novità dei controlli XAML, le viste multiple e altre interessanti API.  ",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "96915916-61ef-4a96-aaa9-dcd6a6670a6c"
  },
  {
    "WorkshopTrackId": "416995af-cc35-4262-9715-65385ba67357",
    "Title": "Introduzione a IoT",
    "Image": null,
    "StartTime": "2015-10-08T14:30:00",
    "EndTime": "2015-10-08T15:00:00",
    "Abstract": "IoT o \u0022Internet of Things\u0022 (Internet delle cose) è solo una moda o una nuova rivoluzione digitale? In questa breve introduzione introdurremo il mondo di IoT e vedremo quali sono i dati allo stato attuale, le previsioni di mercato e le possibili opportunità per chi opera nel campo software e hardware.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "d47bb696-4dd1-4c6a-9f40-eba84257fa2c"
  },
  {
    "WorkshopTrackId": "85a50fe7-b88d-4461-85a6-6b2818f8c5f3",
    "Title": "Il ruolo del cloud nell\u0027Internet of Things: gestire, elaborare e presentare i dati con i servizi di Microsoft Azure",
    "Image": null,
    "StartTime": "2015-10-08T18:15:00",
    "EndTime": "2015-10-08T19:10:00",
    "Abstract": "L\u0027Internet of Things permette di ottenere un valore a partire dai dati raccolti utilizzando device di vario tipo. Il cloud assume un\u0027importanza fondamentale in questo contesto, legato alla sua capacità di ingestion di grandi quantità di dati, di elaborazione real time e di presentazione delle informazioni così ottenute. Microsoft Azure offre diversi servizi per gestire al meglio queste necessità, prestando particolare attenzione alla sicurezza del dato durante la trasmissione. Nel corso di questa sessione sfrutteremo un esempio di telemetria per mostrare come funzionano i principali servizi di Azure legati al mondo IoT: Event Hubs per l\u0027ingestion dei dati, Stream Analytics per l\u0027elaborazione, PowerBI per la presentazione.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "d47bb696-4dd1-4c6a-9f40-eba84257fa2c"
  },
  {
    "WorkshopTrackId": "f0b0acaf-6794-46e5-8bcb-b95e1ed3134d",
    "Title": "Windows 10 per IoT",
    "Image": null,
    "StartTime": "2015-10-08T16:15:00",
    "EndTime": "2015-10-08T17:15:00",
    "Abstract": "Con l’ultima versione, Microsoft ha trasformato il suo sistema operativo in una piattaforma universale.\r\nNoi “sviluppatori Windows” possiamo così finalmente espandere le nostre frontiere ed entrate a pieno titolo anche nel mondo IoT. Ma in che modo possiamo sfruttare questo nuovo mondo di opportunità? Sia che si tratti di un nuovo progetto che di arricchirne uno già consolidato, qual è il “prezzo” da pagare? Quali vantaggi comporta la scelta di Windows 10 rispetto ad altre soluzioni più tradizionali? Per quali scenari si può considerare la scelta vincente?Queste le principali domande a cui cercherò di dare risposta in modo pratico e magari divertente, in una sessione fatta di codice e fili.",
    "Level": 300,
    "Speakers": [],
    "WorkshopId": "d47bb696-4dd1-4c6a-9f40-eba84257fa2c"
  },
  {
    "WorkshopTrackId": "eea9a49d-a314-4162-bcc1-ba3b08ef1682",
    "Title": "Internet of Things: I devices",
    "Image": null,
    "StartTime": "2015-10-08T15:00:00",
    "EndTime": "2015-10-08T16:00:00",
    "Abstract": "I dispositivi hardware sono il cuore pulsante del mondo IoT ma la scelta è tutt\u0027altro che triviale. Microcontrollore o PC? Quale kit di sviluppo utilizzare? Device complesso e costoso o semplice ed economico? Come comunicare tra device? E quali sono i problemi sulla sicurezza?\r\nNel corso della sessione vedremo alcune tra le piattaforme hardware più note come Arduino e Raspberry ma anche dei microcontrollori, analizzando i differenti punti di forza, i sistemi di sviluppo e naturalmente tanti prototipi e sensori.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "d47bb696-4dd1-4c6a-9f40-eba84257fa2c"
  },
  {
    "WorkshopTrackId": "a177fdbb-4c29-43f1-9228-98932551f9ae",
    "Title": "NUI e Biometrics in Windows 10",
    "Image": null,
    "StartTime": "2015-10-08T17:15:00",
    "EndTime": "2015-10-08T18:15:00",
    "Abstract": "Al giorno d\u0027oggi, l\u0027utilizzo di NUI (Natural User Interface) rendono possibili nuove modalità di interazione tra utente e dispositivo. Vediamo come Microsoft Kinect e Intel Realsense ed I relastivi SDK rendono possibile l’implementazione di queste tecnologie nelle nostre applicazioni, nonche’ le recenti applicazioni di autenticazione biometrica introdotte in Windows 10.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "d47bb696-4dd1-4c6a-9f40-eba84257fa2c"
  },
  {
    "WorkshopTrackId": "584c5a96-e7a9-4803-8888-92095a25968e",
    "Title": "Introduzione",
    "Image": null,
    "StartTime": "2016-03-18T16:00:00",
    "EndTime": "2016-03-18T16:30:00",
    "Abstract": "Raffaele Rialdi (DotNetLiguria) e Claudio Firpo (Ordine degli Ingegneri di Genova)",
    "Level": 0,
    "Speakers": [],
    "WorkshopId": "af37706a-0be1-497e-9c27-f1bad19f5aeb"
  },
  {
    "WorkshopTrackId": "3de90e0f-a685-4f6c-87ba-d26668c012f3",
    "Title": "Introduzione a DotNetCore",
    "Image": null,
    "StartTime": "2016-03-18T16:30:00",
    "EndTime": "2016-03-18T17:30:00",
    "Abstract": "La grande famiglia del Framework.NET una nuova variante di CLR e librerie chiamata DotNetCore. Si tratta di un fork del più noto .NET che annovera 1.8 miliardi di installazioni. Le motivazioni di questa grande svolta sono la necessità di sviluppare cross-platform, cross-device e soprattutto la possibilità di abbattere le dipendenze al minimo, tanto che ogni namespace del framework viene installato separatamente e on-demand tramite nuget.\r\nQuali sono le implicazioni delle odierne applicazioni? Quali sono i vantaggi nell\u0027approdare a DotNetCore? Quali sono i vantaggi architetturali che ne derivano?\r\nNel corso della sessione vedremo alcuni esempi basati sugli attuali «Application Model» ASP.NET Core e Universal Windows Platform e vedremo diversi scenari di utilizzo.",
    "Level": 100,
    "Speakers": [],
    "WorkshopId": "af37706a-0be1-497e-9c27-f1bad19f5aeb"
  },
  {
    "WorkshopTrackId": "6255b0e7-e259-4dfe-b8bf-4823caeed504",
    "Title": "Microservice: SOA e DDD alla massima potenza",
    "Image": null,
    "StartTime": "2016-03-18T17:35:00",
    "EndTime": "2016-03-18T18:35:00",
    "Abstract": "Microservice è sulla bocca di tutti, ma sappiamo veramente cosa sono i microservice e che problema vogliono risolvere? E ancora quanto deve essere micro un microservice per poter essere definito tale? Tutte domande interessanti che prima di essere risposte impongono di comprendere quale sia la genesi dei microservice.\r\nObiettivo di questa sessione è introdurre i concetti alla base di SOA, capire la relazione tra SOA e DDD e infine comprendere come si incastra il concetto di microservice presentando una possibile implementazione con un\u0027architettura basata su messaggi.",
    "Level": 200,
    "Speakers": [],
    "WorkshopId": "af37706a-0be1-497e-9c27-f1bad19f5aeb"
  },
  {
    "WorkshopTrackId": "7e99d6b8-c5db-458e-bda6-2d468f274618",
    "Title": "ServiceFabric: microservices in salsa Azure",
    "Image": null,
    "StartTime": "2016-03-18T18:35:00",
    "EndTime": "2016-03-18T19:35:00",
    "Abstract": "Una delle buzzword del momento è sicuramente \u0022microservices\u0022. Chi si è avventurato in questo \u0022mondo\u0022 ha sicuramente avuto a che fare con diversi problemi sia implementativi sia di gestione dell\u0027infrastruttura necessaria per garantire all\u0027intero sistema caratteristiche quali per esempio scalabilità e alta affidabilità\u0027. Service Fabric è la risposta di Azure a questo genere di scenari. In questa sessione analizzeremo le caratteristiche di Service Fabric, introducendo il concetto di \u0022Actor Model\u0022 per poi entrare nel dettaglio di come strutturare e scrivere applicazioni che ne possano sfruttare le potenzialità.",
    "Level": 300,
    "Speakers": [],
    "WorkshopId": "af37706a-0be1-497e-9c27-f1bad19f5aeb"
  }
]